# IFC_DMDeleteEntry

## Description
Deletes an entry from indicated object, from current IFC Data Mapping.

```pascal
FUNCTION IFC_DMDeleteEntry(
				inStrObjName   : STRING;
				inStrEntryName : STRING) : BOOLEAN;
```

```python

def vs.IFC_DMDeleteEntry(inStrObjName, inStrEntryName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inStrObjName|STRING||
|inStrEntryName|STRING||

## Version
Availability: from Vectorworks 2017
## Category
* IFC